# GetSuperscriptStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetSuperscriptStatus Method
FormattedText Class See Also
---
Returns whether All, None or a Mixed of characters in the entire text are superscripted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FormatStatus GetSuperscriptStatus()
```

Visual Basic
---
```text
Public Function GetSuperscriptStatus As FormatStatus
```

Visual C++
---
```text
public:
FormatStatus GetSuperscriptStatus()
```

# ### Return Value
The format status of superscript on characters FormatStatus.
# Remarks
This function only returns All or None if the entire text contains one character.
# See Also
FormattedText Class
GetSuperscriptStatus Overload
Autodesk.Revit.DB Namespace